tap 'caskroom/cask'
tap 'caskroom/versions'

brew 'git'
brew 'npm'
brew 'rbenv'
brew 'ruby-build'
brew 'postgres'

cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'pgadmin4'
cask 'slack'
cask 'sublime-text'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'

# cask 'gimp'
# cask 'opera'
# cask 'spectacle'
# cask 'sequel-pro'

# mas 'Slack', id: 803453959

# mas 'Numbers', id: 409203825
# mas 'Pages', id: 409201541
# mas 'Sip', id: 507257563 
# mas 'Simplenote', id: 692867256 
# mas 'Todoist', id: 585829637