# Reference to refer: https://github.com/Homebrew/homebrew-bundle

tap 'caskroom/cask'
tap 'caskroom/versions'

brew 'elixir'
brew 'exercism'
brew 'git'
brew 'go', args: ['--cross-compile-common']
brew 'heroku-toolbelt'
brew 'htop'
brew 'npm'
brew 'postgres'
brew 'rbenv'
brew 'ruby-build'

cask 'cyberduck'
cask 'filezilla'
cask 'firefox'
cask 'flux'
cask 'docker-toolbox'
cask 'google-chrome'
cask 'iterm2'
cask 'pgadmin4'
cask 'slack'
cask 'sublime-text'
cask 'skype'
cask 'teamviewer'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'

cask 'xquartz'

# The below line is very important for Dia to work on Mac
# and its added at line no. 39 /Applications/Dia.app/Contents/Resources/bin/dia the .zshrc file.
# http://navkirats.blogspot.de/2014/10/dia-diagram-mac-osx-yosemite-fix-i-use.html
# export DISPLAY=:0
cask 'dia'